{
  "selected_keywords": [
    {
      "keyword": "weights dumbbells set",
      "zone": "ZONE_B",
      "score": 143389.0,
      "reason": "Very high search volume, core product phrase combining 'weights' and 'dumbbells set' which matches the item and boosts broad discoverability."
    },
    {
      "keyword": "dumbbells set women",
      "zone": "ZONE_B",
      "score": 94089.0,
      "reason": "High volume, strong intent phrase targeting women; aligns with light 1.5 kg pink neoprene dumbbells and likely audience."
    },
    {
      "keyword": "dumbbell set",
      "zone": "ZONE_B",
      "score": 52761.0,
      "reason": "High-volume generic product term; essential broad match phrase for all dumbbell products."
    },
    {
      "keyword": "2kg dumbbells pair",
      "zone": "ZONE_B",
      "score": 22586.0,
      "reason": "High volume and very close to actual spec (1.5 kg pair); relevant size-range search that can still convert for this light-weight product."
    },
    {
      "keyword": "hand weights for women",
      "zone": "ZONE_B",
      "score": 20210.0,
      "reason": "Strong multi-word phrase with clear use-case and audience; matches pink neoprene hand weights positioning."
    },
    {
      "keyword": "gym weights",
      "zone": "ZONE_B",
      "score": 16682.0,
      "reason": "High-volume generic gym term; broadens reach for users searching general weights for gym/exercise."
    },
    {
      "keyword": "adjustable dumbbells",
      "zone": "ZONE_B",
      "score": 14771.0,
      "reason": "High search volume dumbbell term; although product is fixed-weight, including this phrase can capture broader dumbbell traffic where customers may still consider fixed options."
    },
    {
      "keyword": "dumbbell sets for women",
      "zone": "ZONE_B",
      "score": 7552.0,
      "reason": "Multi-word, women-focused phrase; complements 'dumbbells set women' and targets the same high-intent segment."
    },
    {
      "keyword": "5 kg dumbbells pair",
      "zone": "ZONE_B",
      "score": 6404.0,
      "reason": "Good volume size-based search; adjacent weight-class term that can still attract shoppers browsing light home dumbbells."
    },
    {
      "keyword": "2.5kg dumbbells pair",
      "zone": "ZONE_B",
      "score": 5465.0,
      "reason": "Relevant size-range phrase with solid volume; helps capture users comparing 1–3 kg dumbbells for home workouts."
    },
    {
      "keyword": "dumbbell sets",
      "zone": "ZONE_B",
      "score": 5178.0,
      "reason": "Plural variant of core product phrase; important for matching different query patterns around dumbbell sets."
    },
    {
      "keyword": "2kg dumbbells",
      "zone": "ZONE_B",
      "score": 5029.0,
      "reason": "High-volume size-specific phrase; close to actual product weight and common search for light dumbbells."
    },
    {
      "keyword": "exercise weights",
      "zone": "ZONE_B",
      "score": 4870.0,
      "reason": "Generic but relevant multi-word phrase; aligns with 'for gym exercise' and broadens reach beyond strict dumbbell terms."
    },
    {
      "keyword": "hex dumbbell",
      "zone": "ZONE_C",
      "score": 3811.0,
      "reason": "Shape/style descriptor; if product has hex shape, this is a valuable style keyword with decent volume for users searching that specific design."
    },
    {
      "keyword": "1.5kg dumbbells pair",
      "zone": "ZONE_B",
      "score": 3249.0,
      "reason": "Direct match to actual spec (1.5 kg pack of 2); highly relevant long-tail phrase that should be explicitly captured."
    }
  ]
}