{
  "selected_keywords": [
    {
      "keyword": "weights for women",
      "zone": "ZONE_B",
      "score": 48162.0,
      "reason": "Very high search volume, relevant to a 5 kg pink kettlebell that will appeal to female home-fitness shoppers."
    },
    {
      "keyword": "kettlebells",
      "zone": "ZONE_B",
      "score": 27072.0,
      "reason": "Core product term with high volume; essential plural form customers use when browsing this category."
    },
    {
      "keyword": "gym weights",
      "zone": "ZONE_B",
      "score": 16682.0,
      "reason": "High-volume generic phrase for strength equipment; relevant and helps capture broader traffic."
    },
    {
      "keyword": "gym equipment",
      "zone": "ZONE_B",
      "score": 10854.0,
      "reason": "High-volume, broad but still category-relevant phrase that improves visibility in sports/fitness searches."
    },
    {
      "keyword": "gym",
      "zone": "ZONE_B",
      "score": 10650.0,
      "reason": "High-volume root term; while broad, it is still relevant to a kettlebell and can aid discoverability."
    },
    {
      "keyword": "gym weights for home",
      "zone": "ZONE_B",
      "score": 6734.0,
      "reason": "Good-volume long-tail phrase targeting home users, a key use case for a single 5 kg kettlebell."
    },
    {
      "keyword": "cast iron kettlebell",
      "zone": "ZONE_B",
      "score": 5045.0,
      "reason": "Highly relevant material/type phrase with strong similarity; valuable complete phrase for product type."
    },
    {
      "keyword": "exercise weights",
      "zone": "ZONE_B",
      "score": 4870.0,
      "reason": "Solid-volume generic phrase that matches the product’s use case for general exercise and fitness."
    },
    {
      "keyword": "kettlebell set",
      "zone": "ZONE_B",
      "score": 4738.0,
      "reason": "Good-volume phrase; although this is a single kettlebell, shoppers often search this term when browsing options."
    },
    {
      "keyword": "5kg kettlebell",
      "zone": "ZONE_B",
      "score": 4169.0,
      "reason": "Highly relevant size-specific phrase that exactly matches the product weight; strong intent keyword."
    },
    {
      "keyword": "fitness",
      "zone": "ZONE_B",
      "score": 3180.0,
      "reason": "Broad but relevant sports/fitness category term that supports overall discoverability."
    },
    {
      "keyword": "home gym",
      "zone": "ZONE_B",
      "score": 3138.0,
      "reason": "Popular phrase for at-home training setups; directly relevant to a single kettlebell purchase."
    },
    {
      "keyword": "exercise weights for women",
      "zone": "ZONE_B",
      "score": 2778.0,
      "reason": "Targeted long-tail phrase combining gender and use case; aligns with pink 5 kg positioning."
    },
    {
      "keyword": "kettlebell 6kg",
      "zone": "ZONE_C",
      "score": 2814.0,
      "reason": "Weight variant phrase; useful as a related size descriptor/variant term even though this SKU is 5 kg."
    },
    {
      "keyword": "6kg kettlebell",
      "zone": "ZONE_C",
      "score": 7592.0,
      "reason": "Variant ordering of the 6 kg size phrase; kept as an additional size-related search pattern."
    }
  ]
}