{
  "selected_keywords": [
    {
      "keyword": "gym equipment",
      "zone": "ZONE_B",
      "score": 10854.0,
      "reason": "High search volume and broad, relevant phrase for a dumbbell rack used in gyms; strong generic traffic driver."
    },
    {
      "keyword": "exercise equipment for home use",
      "zone": "ZONE_B",
      "score": 5996.0,
      "reason": "High-volume multi-word phrase directly matching home-use intent for a compact dumbbell stand."
    },
    {
      "keyword": "home gym equipment",
      "zone": "ZONE_B",
      "score": 3700.0,
      "reason": "Strong, focused phrase for buyers building a home gym where a dumbbell rack is a core storage item."
    },
    {
      "keyword": "barbell",
      "zone": "ZONE_B",
      "score": 3299.0,
      "reason": "High-volume strength-training term; relevant category adjacency that can help visibility in weight training searches."
    },
    {
      "keyword": "set of weights",
      "zone": "ZONE_B",
      "score": 3291.0,
      "reason": "Broad multi-word phrase; shoppers searching for weight sets often need storage like a dumbbell rack."
    },
    {
      "keyword": "20 kg kettlebell",
      "zone": "ZONE_C",
      "score": 3263.0,
      "reason": "Good volume and related to free-weight storage; can capture kettlebell/weight buyers browsing compatible equipment."
    },
    {
      "keyword": "1.5kg dumbbells pair",
      "zone": "ZONE_C",
      "score": 3249.0,
      "reason": "Specific dumbbell phrase; relevant to users searching for small dumbbells who may also need a rack."
    },
    {
      "keyword": "amazon dumbbells",
      "zone": "ZONE_B",
      "score": 3228.0,
      "reason": "High similarity and volume; people searching this term are in the dumbbell ecosystem and may need a rack."
    },
    {
      "keyword": "4kg dumbbells",
      "zone": "ZONE_C",
      "score": 3171.0,
      "reason": "Common dumbbell size; relevant adjacent search that can help the rack appear in dumbbell-related results."
    },
    {
      "keyword": "18kg kettlebell",
      "zone": "ZONE_C",
      "score": 3072.0,
      "reason": "Related free-weight term; supports visibility among strength-training equipment shoppers."
    },
    {
      "keyword": "16 kg kettlebell",
      "zone": "ZONE_C",
      "score": 3065.0,
      "reason": "Another popular kettlebell size; maintains phrase integrity and targets weight-training audiences."
    },
    {
      "keyword": "dumbbell sets for men",
      "zone": "ZONE_B",
      "score": 2884.0,
      "reason": "Relevant multi-word phrase; users buying dumbbell sets often need a compact rack for organization."
    },
    {
      "keyword": "kettlebell 24kg",
      "zone": "ZONE_C",
      "score": 2864.0,
      "reason": "Heavier kettlebell phrase; keeps coverage across multiple kettlebell weight searches tied to storage needs."
    },
    {
      "keyword": "0.5kg dumbbells",
      "zone": "ZONE_C",
      "score": 2861.0,
      "reason": "Light dumbbell size; relevant to home fitness buyers who may also purchase a small-footprint rack."
    },
    {
      "keyword": "kettlebell 6kg",
      "zone": "ZONE_C",
      "score": 2814.0,
      "reason": "Popular entry-level kettlebell size; maintains breadth across kettlebell-related search traffic."
    }
  ]
}