{
  "selected_keywords": [
    {
      "keyword": "weights",
      "zone": "ZONE_B",
      "score": 30386.0,
      "reason": "Highest score term; broad, high-volume generic for strength equipment and directly relevant to kettlebells."
    },
    {
      "keyword": "kettlebells",
      "zone": "ZONE_B",
      "score": 27072.0,
      "reason": "Core plural product term with very high score; matches how many shoppers search and complements singular form."
    },
    {
      "keyword": "kettlebell",
      "zone": "ZONE_B",
      "score": 26188.0,
      "reason": "Primary singular product keyword; essential exact match for main search intent."
    },
    {
      "keyword": "kettle bell",
      "zone": "ZONE_B",
      "score": 24880.0,
      "reason": "Common spaced variant of the main product term; captures additional search traffic."
    },
    {
      "keyword": "16kg kettlebell",
      "zone": "ZONE_B",
      "score": 22761.0,
      "reason": "High-volume complete phrase combining weight and product; strong intent keyword for a popular size in the range."
    },
    {
      "keyword": "12kg kettlebell",
      "zone": "ZONE_B",
      "score": 20094.0,
      "reason": "High-score size-specific phrase; matches one of the listed available weights and captures targeted searches."
    },
    {
      "keyword": "10kg kettlebell",
      "zone": "ZONE_B",
      "score": 18533.0,
      "reason": "Popular mid-range weight phrase; strong search intent and directly relevant to the size options."
    },
    {
      "keyword": "20kg kettlebells",
      "zone": "ZONE_B",
      "score": 17689.0,
      "reason": "High-intent phrase for heavier weight; plural form broadens reach for users searching sets or multiple bells."
    },
    {
      "keyword": "gym weights",
      "zone": "ZONE_B",
      "score": 16682.0,
      "reason": "Broad but relevant multi-word phrase; captures users searching general gym weight equipment including kettlebells."
    },
    {
      "keyword": "8kg kettlebell",
      "zone": "ZONE_B",
      "score": 13009.0,
      "reason": "Common lighter size phrase; aligns with listed size options and targets specific buyer intent."
    },
    {
      "keyword": "kettlebell 20kg",
      "zone": "ZONE_B",
      "score": 11337.0,
      "reason": "High-intent exact phrase for the hero size (20 kg); order variant of the same strong keyword family."
    },
    {
      "keyword": "20kg kettlebell",
      "zone": "ZONE_B",
      "score": 10599.0,
      "reason": "Direct, high-relevance phrase for the main showcased weight; critical for exact-match search coverage."
    },
    {
      "keyword": "gym equipment",
      "zone": "ZONE_B",
      "score": 10854.0,
      "reason": "Broad category-level phrase with solid volume; helps visibility in general fitness equipment searches."
    },
    {
      "keyword": "24kg kettlebell",
      "zone": "ZONE_B",
      "score": 8655.0,
      "reason": "Heavier size phrase with good volume; matches one of the available weights and attracts advanced users."
    },
    {
      "keyword": "kettlebell 12kg",
      "zone": "ZONE_B",
      "score": 8609.0,
      "reason": "Order variant of a strong size-specific term; reinforces coverage for 12 kg searches in different word order."
    }
  ]
}