{
  "selected_keywords": [
    {
      "keyword": "weights for women",
      "zone": "ZONE_B",
      "score": 48162.0,
      "reason": "High search volume, relevant general strength training term that can attract female buyers for kettlebell workouts."
    },
    {
      "keyword": "weight set",
      "zone": "ZONE_B",
      "score": 30339.0,
      "reason": "Very high volume generic strength training term; relevant to buyers searching for free weight options including kettlebells."
    },
    {
      "keyword": "kettlebells",
      "zone": "ZONE_B",
      "score": 27072.0,
      "reason": "Core product term in plural form with strong volume; directly relevant and essential for discoverability."
    },
    {
      "keyword": "gym weights",
      "zone": "ZONE_B",
      "score": 16682.0,
      "reason": "High-volume generic phrase for strength equipment; relevant to kettlebells as a type of gym weight."
    },
    {
      "keyword": "gym equipment",
      "zone": "ZONE_B",
      "score": 10854.0,
      "reason": "Broad but high-volume category phrase; helps capture general fitness shoppers looking for home gym gear."
    },
    {
      "keyword": "kettlebell 12 kg",
      "zone": "ZONE_B",
      "score": 6735.0,
      "reason": "Highly relevant size-specific kettlebell phrase with strong similarity; good for weight-based searches even if this listing is 10 kg."
    },
    {
      "keyword": "weight sets for men",
      "zone": "ZONE_B",
      "score": 5740.0,
      "reason": "Good volume gender-targeted strength term; can broaden reach to male buyers considering kettlebells as part of weight sets."
    },
    {
      "keyword": "kettlebell set",
      "zone": "ZONE_B",
      "score": 4738.0,
      "reason": "Popular multi-word phrase; relevant for users searching for kettlebell options and variants."
    },
    {
      "keyword": "4kg kettlebell",
      "zone": "ZONE_B",
      "score": 4520.0,
      "reason": "Specific kettlebell weight phrase; useful to rank for multiple weight searches within the same product family."
    },
    {
      "keyword": "kettlebell 8 kg",
      "zone": "ZONE_B",
      "score": 4052.0,
      "reason": "Another strong size-specific kettlebell query; supports coverage across common kettlebell weights."
    },
    {
      "keyword": "competition kettlebell",
      "zone": "ZONE_B",
      "score": 3309.0,
      "reason": "Relevant multi-word phrase for users seeking higher-quality or standardised kettlebells; good niche coverage."
    },
    {
      "keyword": "20 kg kettlebell",
      "zone": "ZONE_B",
      "score": 3263.0,
      "reason": "High-intent size-specific kettlebell term; helps capture advanced users searching heavier options."
    },
    {
      "keyword": "16 kg kettlebell",
      "zone": "ZONE_B",
      "score": 3065.0,
      "reason": "Common kettlebell weight phrase; complements other weight variants for broader search coverage."
    },
    {
      "keyword": "exercise weights for women",
      "zone": "ZONE_B",
      "score": 2778.0,
      "reason": "Multi-word, gender- and use-case-specific phrase with good volume; aligns with kettlebell use for workouts."
    },
    {
      "keyword": "fitness equipment",
      "zone": "ZONE_B",
      "score": 1860.0,
      "reason": "Relevant broad category phrase with ad activity; supports visibility among general fitness gear searches."
    }
  ]
}